{
    "configurations": {
        "pdf" : "false",
        "html": "true",
        "tex":  "false"
    },

    "header" : {
        "firstname": "Narayana Chikkam",
        "email": "nchikkam@gmail.com",
        "phone": "+91-999-999-999",
        "talents": ["Python", "C/C++", "Java", "Javascript", "Passion"]
    },

    "education":[
        "Bachelor’s degree in Computer Science from Jawaharlal Nehru Technological University in 2003 being University topper in a row of two consequtive semesters",
        "Diploma in Polytechnique and Engineering with collage topper award in 1999"
    ],

    "opensource":[
        ["algorithms", "https://algoprdgms.appspot.com/"],
        ["git",        "https://github.com/nchikkam"],
        ["nodejs",     "https://www.npmjs.com/~nchikkam"],
        ["python",     "https://code.activestate.com/recipes/users/4174427/"]
    ],

    "experience":{
        "items": [
            {
                "title": "Senior Software Developer/Lead",
                "organisation": "Nokia Berlin, maps.here.com",
                "duration": "Dec. 2011 - Present",
                "projects": [
                    "Here maps Berlin is specialized in map applications for the windows phone and GPS devices. I have been part of the core Traffic team in designing and automating various features.",
                    "Developed a simple framework in python to integrate changes from traffic, Routing, guidance into a single build job on Jenkins.",
                    "TPEG is a standard protocol for communicating with the car devices in terms of providing traffic. I developed a ruby module that follows this standard and this framework has been used extensively for the tests on GO pipelines internal to the organization.",
                    "Contributed in TDD code reviews and knowledge sharing session to the team.",
                    "Following regular releases, scrum agile principles along with pair programming for the successful deliveries."
                ],
                "technologies": {
                    "tools": [
                        "Java",
                        "Python",
                        "Ruby",
                        "Cucumber",
                        "JavaScript",
                        "Jenkins",
                        "Go",
                        "Map Tile Systems",
                        "AWS",
                        "Nginx",
                        "Docker",
                        "Amazon S3",
                        "GIT", 
                        "Maven"
                    ]
                }
            },
            {
                "title": "Senior Staffmember/Specialist",
                "organisation": "Yellowpages.com.mt, Malta",
                "duration": "Dec. 2010 - Dec. 2011",
                "projects": [
                    "Yellow pages is a small company based in Malta and they serve two kinds of service to the users. Yellow Pages book and online information. People can search for a business, heading, keyword or brand and can find the list of things related by those words. I joined the team and helped them in making their products more robust.",
                    "Redesigning the whole internal organization of the code and modules, Autosuggest for the search functionality.",
                    "Optimization of stored procedures and analyzing big queries",
                    "Rewrote the architecture of the back end modules and supported the web developers for the new search – categorized functionality.",
                    "Code reviews, commits and regular knowledge sharing sessions with pair programming for the releases."
                ],
                "technologies": {
                    "tools": [
                        "C#",
                        ".net",
                        "IIS",
                        "Subversion",
                        "MYSQL",
                        "ORACLE"
                    ]
                }
            },
            {
                "title": "Senior Developer",
                "organisation": "Uniblue.com, Malta",
                "duration": "May. 2010 - Dec. 2010",
                "projects": [
                    "Uniblue.com systems [5 developers including me] is a company that develops software in python to support Users by providing a suite of products. We follow agile methodology and our products now are in Python, Django powered sites",
                    "Worked on Registry Cleaning Software tools written in Python and C++",
                    "Driver Scanner tool that diagnoses the problems with the hard disk drives and reports the issues on a regular basis to the end users",
                    "Process explorer web application that helps users to find what a given process is actually meant for",
                    "Generating the descriptoins for more than 30 languages using tools Systran, google translator and bing translator"
                ],
                "technologies": {
                    "tools": [
                        "C++",
                        "Python",
                        "Perl",
                        "Javascript",
                        "Unit and Integration testing tools",
                        "Systran"
                    ]
                }
            },
            {
                "title": "Senior Software Developer",
                "organisation": "SabreHoldings.com, Bangalore, India",
                "duration": "Jul. 2009 - May. 2010",
                "projects": [
                    "One of the things I worked here that had a benefit was writing and analyzing ILOG Rules, a business rules processing framework that allows business analysts to make quick and effective decisions based on Airline Revenue Data",
                    "The team was distributed across the globe with 3 from India, 2 in Europe and 2 in Dallas, I managed the India part.",
                    "Made TDD mandatory for the team. I am the main contact with two juniors working with me.",
                    "Closely worked with Business Analysts, Customers to tweak the estimations so as to fulfil the needs in specific markets"
                ],
                "technologies": {
                    "tools": [
                        "C++",
                        "Python",
                        "Java",
                        "Maven",
                        "Subversion",
                        "ILOG JRules",
                        "Custom Airline Revenue Management tools like Airmax"
                    ]
                }
            },
            {
                "title": "Senior Software Engineer",
                "organisation": "Yahoo.com, Bangalore, India",
                "duration": "Jan. 2007 - Apr. 2009",
                "projects": [
                    "Generating demographical data from 14TB of logs by using a distributed framework that mines the logs into small data marts for effective decision making. Technologies used were Linux, Python, Perl, C++ and a framework similar to Hadoop",
                    "Worked on prototypes and solutions for problems like If Business wants to know the revenue generated by yahoo search property, during the peak traffic hours 6AM to 9PM, created by the users in age group (25 to 35) from the Asia geographical area and that too from India. Business insight queries needs scanning the whole warehouse data, indexing them for the further queries, supporting retentions etc",
                    "Worked with teams to drive the systems from requirement gatherings to well architected process deployments.",
                    "Designed and developed modules to support the scalability issues.",
                    "Interacted with colleagues and Product Managers to get various inputs, prototyping statistical data of competitor’s for market analysis",
                    "Motivating the team for their participation in Hack Days and idea sharing events.",
                    "Leading projects such as report reviews, weekly and monthly updates, weekly an monthly user retention updates, and other projects with the team.",
                    "Managing trouble-shooting activities, planning, utilizing the hard ware resources to the maximum extent",
                    "Won data wizard award with the team. It is one of the critical awards which teams get rarely."
                ],
                "technologies": {
                    "tools": [
                        "C++",
                        "Python",
                        "Java",
                        "Maven",
                        "Subversion",
                        "Linux",
                        "Freebsd",
                        "Perl",
                        "Hadoop"
                    ]
                }
            },
            {
                "title": "SDE(Software Development Engineer)",
                "organisation": "Amazon.com, Chennai, India",
                "duration": "Dec. 2005 - Jan. 2007",
                "projects": [
                    "Primary contact to resolve and support the crawling across multiple competitors.",
                    "Completely owned the design of bands based crawling for various competitor strategies.",
                    "Migration contact for the whole team, to migrate all the Perl script packages from rhel3 from rhel7.2.",
                    "Primary contact for the operational issues and load – focus on improving the system efficiency.",
                    "Helping other ream members in analysis, design, coding and testing of critical modules.",
                    "Responsible to share and take multiple tasks, prioritizing and resolving. During on call time, I spent 60% of the time on operational issues and remaining time on assigned projects.",
                    "Did the re-architecture and design of equal Distribution of domains project and successfully resolved the competitors blocking issues.",
                    "Designed a scalable system to support and report the ASIN health and auditing records which resolved the time taking and out of memory scalability issues.",
                    "Suggested a business tool that helps the QA teams in identifying the critical issues with the product mismatches. This helped the whole team later on to track any issue in the competitive monitoring tools project."
                ],
                "technologies": {
                    "tools": [
                        "C++",
                        "Python",
                        "Java",
                        "Maven",
                        "Subversion",
                        "Clearcase",
                        "Linux",
                        "Freebsd",
                        "Perl"
                    ]
                }
            },
            {
                "title": "Systems Software Engineer",
                "organisation": "hp.com, Bangalore, India",
                "duration": "Oct. 2003 - Dec. 2005",
                "projects": [
                    "Worked on a Diagnostic tool that diagnoses issues with the tape drives and cartridges by contributing more than 50K loc in C++ and VC++",
                    "Wrote many scripts in a custom language developed especially for the tests using lex, yacc and custom compilers",
                    "Developed a model for the CIMM [Common Information Management Modules] in Java for the monitoring of the racks filled drives and devices",
                    "Supporting L&TT 4.0 major release by writing more than 100 Perl scripts, 20000 lines C++.",
                    "Designing Class Diagrams, Test cases. Analyzing, reviewing the code changes by other team members. Developing several PERL scripts for the tool.",
                    "Trouble shooting the issues at customer sites via support tickets, driving the complete CPE activities",
                    "Owning of the Ruther Ford CUI design changes. And testing the every release of the product.",
                    "Wrote 27K lines of code in C++ within 3 weeks and more than 80 Perl scripts as a beginner"
                ],
                "technologies": {
                    "tools": [
                        "C++",
                        "VC++",
                        "Java",
                        "Maven",
                        "ant",
                        "Subversion",
                        "Clearcase",
                        "Linux",
                        "Perl"
                    ]
                }
            }

        ]
    }
}